<a href="https://colab.research.google.com/github/IsauraRs/Data-Science-BEDU/blob/master/M%C3%B3dulo2/Python/Sesi%C3%B3n8/Reto2_S08.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Reto 2: Convertir tablas en MySQL a `DataFrames` de `pandas`

### 1. Objetivos:
    - Solicitar todos los datos de las tablas que están almacenadas en nuestra base de datos, convertirlos a `DataFrames` y guardarlos.
    
---
    
### 2. Desarrollo:

#### a) Tablas a `DataFrames`

Ya que tenemos nuestra conexión funcionando adecuadamente, vamos a utilizarla para realizar consultas a las base de datos y construir una base de datos local. Tu Reto consiste en los siguientes pasos:

1. Vuelve a establecer la conexión a la base de datos
2. Usando el comando `SELECT * FROM nombre_de_tabla`, realiza consultas a cada una de las 5 tablas que existen en la base de datos.
3. Crea un `DataFrame` por cada tabla que obtuviste. Para asignarle los nombres de las columnas correctamente, revisa el archivo [Readme.md](../../Datasets/MovieLens/Readme.md) donde está contenida toda esa información.
4. Asegúrate de que el índice sea adecuado en cada `DataFrame`. En los casos en los que haya datos redundantes, convierte una de las columnas en índice.
5. Si lo deseas ordena las columnas de la manera en la que mejor te parezca.
6. Guarda tus `DataFrames` en formato .csv para utilizarlos en los siguientes Retos.

> **NOTA IMPORTANTE**: La tabla movies es un poco complicada porque contiene muchos signos distintos. Tanto en la columna de nombre de película como la de género, encontramos signos como `,`, `:`, `.`, `|`. Esto hace un poco complicado el almacenamiento y lectura de este archivo. Si elijes guardar este archivo como un .csv separado por comas (`,`), a la hora de leerlo de regreso, `pandas` puede confundirse y pensar que el título de una película que contiene comas constituye dos columnas. Por esta razón, te recomiendo que la tabla `movies` la guardes agregando un separador poco convencional como `sep='$'`. De esta manera será muchísimo más fácil leer tu archivo de regreso usando ese separador.

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [ ]:
!pip install mysql-connector-python

Collecting mysql-connector-python
  Downloading https://files.pythonhosted.org/packages/de/f7/b783b60a3bd8aea348990c60fb0b3ed2f843c6f40ad29e37a89a5d50d7a3/mysql_connector_python-8.0.23-cp37-cp37m-manylinux1_x86_64.whl (18.0MB)
     |████████████████████████████████| 18.1MB 20.5MB/s
Requirement already satisfied: protobuf>=3.0.0 in /usr/local/lib/python3.7/dist-packages (from mysql-connector-python) (3.12.4)
Requirement already satisfied: setuptools in /usr/local/lib/python3.7/dist-packages (from protobuf>=3.0.0->mysql-connector-python) (54.0.0)
Requirement already satisfied: six>=1.9 in /usr/local/lib/python3.7/dist-packages (from protobuf>=3.0.0->mysql-connector-python) (1.15.0)
Installing collected packages: mysql-connector-python
Successfully installed mysql-connector-python-8.0.23

In [ ]:
import mysql.connector
import pandas as pd

In [ ]:
# Tu código va a aquí
cnx = mysql.connector.connect(
    host = "ec2-34-219-184-154.us-west-2.compute.amazonaws.com",
    port = 3306,
    user = "data",
    password = "khQ9--mp6LWq97iA",
    database = "movielens"

)

cursor = cnx.cursor()

In [ ]:
cursor.execute("SHOW TABLES")

In [ ]:
cursor.fetchall()

[('age_ranges',), ('movies',), ('occupations',), ('ratings',), ('users',)]

In [ ]:
cursor = cnx.cursor()

In [ ]:
cursor.execute("SELECT * FROM users")

In [ ]:
result = cursor.fetchall()

In [ ]:
result

In [ ]:
df_users = pd.DataFrame(result, columns = ["user_id","gender","age","occupation","cp"])

In [ ]:
df_users

      user_id gender  age  occupation     cp
0           1      F    1          10  48067
1           2      M   56          16  70072
2           3      M   25          15  55117
3           4      M   45           7  02460
4           5      M   25          20  55455
...       ...    ...  ...         ...    ...
6035     6036      F   25          15  32603
6036     6037      F   45           1  76006
6037     6038      F   56           1  14706
6038     6039      F   45           0  01060
6039     6040      M   25           6  11106

[6040 rows x 5 columns]

In [ ]:
df_users = df_users.set_index("user_id", drop = True)

In [ ]:
df_users

        gender  age  occupation     cp
user_id
1            F    1          10  48067
2            M   56          16  70072
3            M   25          15  55117
4            M   45           7  02460
5            M   25          20  55455
...        ...  ...         ...    ...
6036         F   25          15  32603
6037         F   45           1  76006
6038         F   56           1  14706
6039         F   45           0  01060
6040         M   25           6  11106

[6040 rows x 4 columns]

In [ ]:
cursor = cnx.cursor()

In [ ]:
cursor.execute("SELECT * FROM movies")

In [ ]:
result_movies = cursor.fetchall()

In [ ]:
result_movies

In [ ]:
df_movies = pd.DataFrame(result_movies, columns = ["movie_id", "title", "genres"])

In [ ]:
df_movies

      movie_id  ...                        genres
0            1  ...   Animation|Children's|Comedy
1            2  ...  Adventure|Children's|Fantasy
2            3  ...                Comedy|Romance
3            4  ...                  Comedy|Drama
4            5  ...                        Comedy
...        ...  ...                           ...
3878      3948  ...                        Comedy
3879      3949  ...                         Drama
3880      3950  ...                         Drama
3881      3951  ...                         Drama
3882      3952  ...                Drama|Thriller

[3883 rows x 3 columns]

In [ ]:
df_movies = df_movies.set_index("movie_id", drop = True)

In [ ]:
cursor =  cnx.cursor()

In [ ]:
cursor.execute("SELECT * FROM age_ranges")

In [ ]:
result_ages = cursor.fetchall()

In [ ]:
df_ages = pd.DataFrame(result_ages, columns= ["age_id", "age_range"])

In [ ]:
df_ages

   age_id age_range
0       1  Under 18
1      18     18-24
2      25     25-34
3      35     35-44
4      45     45-49
5      50     50-55
6      56       56+

Compara con tus compañeros y revisa con la experta para que todos estén seguros de que tienen sus `DataFrames` estructurados de la manera correcta y que sus archivos .csv fueron creados exitosamente. Vamos a utilizar estos archivos en los Retos siguientes, así que es muy importante que tus datos estén estructurados adecuadamente.

In [ ]:
df_ages = df_ages.set_index("age_id", drop = True)

In [ ]:
df_ages

       age_range
age_id
1       Under 18
18         18-24
25         25-34
35         35-44
45         45-49
50         50-55
56           56+

In [ ]:
cursor = cnx.cursor()

In [ ]:
cursor.execute("SELECT * FROM occupations")

In [ ]:
result_occupations = cursor.fetchall()

In [ ]:
df_occupations = pd.DataFrame(result_occupations, columns = ["occupation_id", "description"])

In [ ]:
df_occupations

    occupation_id             description
0               0  other or not specified
1               1       academic/educator
2               2                  artist
3               3          clerical/admin
4               4    college/grad student
5               5        customer service
6               6      doctor/health care
7               7    executive/managerial
8               8                  farmer
9               9               homemaker
10             10            K-12 student
11             11                  lawyer
12             12              programmer
13             13                 retired
14             14         sales/marketing
15             15               scientist
16             16           self-employed
17             17     technician/engineer
18             18     tradesman/craftsman
19             19              unemployed
20             20                  writer

In [ ]:
df_occupations = df_occupations.set_index("occupation_id", drop = True)

In [ ]:
df_occupations

                          description
occupation_id
0              other or not specified
1                   academic/educator
2                              artist
3                      clerical/admin
4                college/grad student
5                    customer service
6                  doctor/health care
7                executive/managerial
8                              farmer
9                           homemaker
10                       K-12 student
11                             lawyer
12                         programmer
13                            retired
14                    sales/marketing
15                          scientist
16                      self-employed
17                technician/engineer
18                tradesman/craftsman
19                         unemployed
20                             writer

In [ ]:
cursor = cnx.cursor()

In [ ]:
cursor.execute("SELECT * FROM ratings")

In [ ]:
result_ratings = cursor.fetchall()

In [ ]:
df_ratings = pd.DataFrame(result_ratings, columns = ["user_id", "movie_id","rating","timestamp"])

In [ ]:
df_ratings

         user_id  movie_id  rating  timestamp
0              1      1193       5  978300760
1              1       661       3  978302109
2              1       914       3  978301968
3              1      3408       4  978300275
4              1      2355       5  978824291
...          ...       ...     ...        ...
1000204     6040      1091       1  956716541
1000205     6040      1094       5  956704887
1000206     6040       562       5  956704746
1000207     6040      1096       4  956715648
1000208     6040      1097       4  956715569

[1000209 rows x 4 columns]

In [ ]:
df_ratings = df_ratings.set_index("user_id", drop = True)

In [ ]:
df_ratings

         movie_id  rating  timestamp
user_id
1            1193       5  978300760
1             661       3  978302109
1             914       3  978301968
1            3408       4  978300275
1            2355       5  978824291
...           ...     ...        ...
6040         1091       1  956716541
6040         1094       5  956704887
6040          562       5  956704746
6040         1096       4  956715648
6040         1097       4  956715569

[1000209 rows x 3 columns]

In [ ]:
df_ratings.to_csv(path_or_buf= "ratings_df.csv", sep= ",")

In [ ]:
df_movies.to_csv(path_or_buf="movies_df.csv", sep = "$")

In [ ]:
df_ages.to_csv(path_or_buf="ages_df.csv", sep= ",")

In [ ]:
df_occupations.to_csv(path_or_buf = "occupations_df.csv" , sep = ",")

In [ ]:
df_users.to_csv(path_or_buf= "users_df.csv", sep = ",")